pp/admin.org
#+TITLE: DAT121 - Organisation
#+EMAIL: bernardy@chalmers.se
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="pp.css" />

This document is generated from an org-mode file.
   - To access it replace .html by .org in the URL for this file
   - It can be read in plain text: header level is indicated by number
     of *
   - Or more conveniently by using Emacs [[http://orgmode.org/][org mode]].
     + Use <TAB> to expand/collapse nodes.
     + C-c C-e b to do HTML rendering and open in your browser
     + Check out the [[http://orgmode.org/orgcard.txt][reference card]].

- Programming paradigms
- Chalmers Course code: DAT121
- G.U. Course Code: DIT331
* The teaching team
+ Jean-Philippe Bernardy
  - Course responsible & lecturer
  - Room: EDIT 5469
  - E-mail: bernardy (chalmers.se)
+ Nikita Frolov
  - Exercise tutor
  - Room: EDIT 5461
  - E-mail: frolov (chalmers.se)
+ Dan Rosén
  - Exercise tutor
  - Room: EDIT 5453
  - E-mail: danr (chalmers.se)
* Schedule
** On TimeEdit:
https://se.timeedit.net/web/chalmers/db1/public/ri1X50gQ9560YvQQ05Z6870Y0Zy6007381Y50Q785.html
** <<Weekly Schedule>>:

+ Lecture 1 - Mon 10.00
+ Lecture 2 - Wed 10.00
+ Exercises (1)
   - Wed 13.15
+ Exercises (2)
   - Thu 9.00
+ Office hours:
  - JP: Mon: 13.15
  - Nik: Thu 15.15
  - Dan: Tue 11:00, room 5453
** <<Timetable>>

| Week | Starts | Lecture 1  | Lecture 2      | Exercises (1)    | Exercises (2) | TAs |
|------+--------+------------+----------------+------------------+---------------+-----|
|    1 |   0119 | No lecture | Intro          | EX 1             | (No session)  | Dan |
|    2 |   0127 | IP 1       | IP 2           | EX 2             |               | Nik |
|    3 |   0202 | OO         | No lecture (∗) | No exercises (∗) |               |     |
|    4 |   0209 | FP 1       | FP 2           | EX 3             |               | Nik |
|    5 |   0216 | FP 3       | CP 1           | EX 4             |               | Nik |
|    6 |   0223 | CP 2       | LP 1           | EX 5             |               | ?   |
|    7 |   0302 | LP 2       | Ljunglöf       | EX 6             |               | ?   |

  (∗): Charm Days

See table below for detail of contents.

| Abbr     | Contents                                                                                 |
|----------+------------------------------------------------------------------------------------------|
| Intro    | Models of computations; types; abstraction                                               |
| IP 1     | Goto ↔ Loops, Inlining procedures, Procedures → Gotos, Pointers and passing by reference |
| IP 2     | Recursion. Substitution model in the presence of recursion, Explicit stack               |
| OO       | Inheritance, Interfaces, Notion of co/contra variance                                    |
| FP 1     | Algebraic Types (Pattern matching, Parametric types, Currification)                      |
| FP 2     | HO Abstraction, Polymorphic functions, Translating away HOF (Inlining, Closures)         |
| FP 3     | Continuations and effects. Purity and laziness.                                          |
| CP 1     | Processes, channels, Resource-managing processes                                         |
| CP 2     | Explicit continuations                                                                   |
| LP 1     | Intro to LP; Unification                                                                 |
| LP 2     | Functions to Relations, Search as list of successes                                      |
| Reboot   |                                                                                          |
| Ljunglöf | Peter Ljunglöf's Guestt lecture (∗∗)                                                     |
| EX 1     | Exercises marked with @1 in file:All.pdf                                                 |
| EX 2     | Exercises marked with @2 in file:All.pdf                                                 |
| EX 3     | Exercises marked with @3 in file:All.pdf                                                 |
| EX 4     | Exercises marked with @4 in file:All.pdf                                                 |
| EX 5     | Exercises marked with @5 in file:All.pdf                                                 |
| EX 6     | ?                                                                                        |

  (∗∗): Peter Ljunglöf will show how to write a natural language
  grammar in Prolog, which will give an automatic recursive-descent
  parser

Note: the contents of each exercise session is about the topics
covered in the two previous lectures. Remember to re-fetch the
file:All.pdf file each week: exercises may have been updated.

* Organisation
** Formal requirements
- Pass the exam (written exam)
- That's it!
** Informal requirements and learning aids
- Do the exercises
- Participate in the exercises sessions: see [[<<Exercises>>][below]] for details.
- Attend the lectures
- Prepare lectures by reading lecture notes and follow relevant links.
