pp/admin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DAT121 - Organisation</title>
<!-- 2016-03-03 tor 07:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jean-Philippe Bernardy" />
<link rel="stylesheet" type="text/css" href="pp.css" />
</head>
<body>
<div id="content">
<h1 class="title">DAT121 - Organisation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The teaching team</a></li>
<li><a href="#sec-2">2. Schedule</a>
<ul>
<li><a href="#sec-2-1">2.1. On TimeEdit:</a></li>
<li><a href="#sec-2-2">2.2. :</a></li>
<li><a href="#sec-2-3">2.3. </a></li>
</ul>
</li>
<li><a href="#sec-3">3. Organisation</a>
<ul>
<li><a href="#sec-3-1">3.1. Formal requirements</a></li>
<li><a href="#sec-3-2">3.2. Informal requirements and learning aids</a></li>
<li><a href="#sec-3-3">3.3. Lectures</a></li>
<li><a href="#sec-3-4">3.4. </a></li>
</ul>
</li>
<li><a href="#sec-4">4. Reading material</a></li>
<li><a href="#sec-5">5. Outline of the course</a>
<ul>
<li><a href="#sec-5-1">5.1. Brief exposition of each paradigm</a></li>
<li><a href="#sec-5-2">5.2. (Some) Transformations between paradigms</a></li>
<li><a href="#sec-5-3">5.3. Learning outcomes</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Course evaluation</a>
<ul>
<li><a href="#sec-6-1">6.1. Volunteer course representatives:</a></li>
<li><a href="#sec-6-2">6.2. Evaluation Meeting 1</a></li>
<li><a href="#sec-6-3">6.3. Evaluation Meeting 2</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This document is generated from an org-mode file.
</p>
<ul class="org-ul">
<li>To access it replace .html by .org in the URL for this file
</li>
<li>It can be read in plain text: header level is indicated by number
of *
</li>
<li>Or more conveniently by using Emacs <a href="http://orgmode.org/">org mode</a>.
<ul class="org-ul">
<li>Use &lt;TAB&gt; to expand/collapse nodes.
</li>
<li>C-c C-e b to do HTML rendering and open in your browser
</li>
<li>Check out the <a href="http://orgmode.org/orgcard.txt">reference card</a>.
</li>
</ul>
</li>

<li>Programming paradigms
</li>
<li>Chalmers Course code: DAT121
</li>
<li>G.U. Course Code: DIT331
</li>
</ul>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The teaching team</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Jean-Philippe Bernardy
<ul class="org-ul">
<li>Course responsible &amp; lecturer
</li>
<li>Room: EDIT 5469
</li>
<li>E-mail: bernardy (chalmers.se)
</li>
</ul>
</li>
<li>Nikita Frolov
<ul class="org-ul">
<li>Exercise tutor
</li>
<li>Room: EDIT 5461
</li>
<li>E-mail: frolov (chalmers.se)
</li>
</ul>
</li>
<li>Dan Rosén
<ul class="org-ul">
<li>Exercise tutor
</li>
<li>Room: EDIT 5453
</li>
<li>E-mail: danr (chalmers.se)
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Schedule</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> On TimeEdit:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://se.timeedit.net/web/chalmers/db1/public/ri1X50gQ9560YvQQ05Z6870Y0Zy6007381Y50Q785.html">https://se.timeedit.net/web/chalmers/db1/public/ri1X50gQ9560YvQQ05Z6870Y0Zy6007381Y50Q785.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <a id="Weekly-Schedule" name="Weekly-Schedule"></a>:</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Lecture 1 - Mon 10.00
</li>
<li>Lecture 2 - Wed 10.00
</li>
<li>Exercises (1)
<ul class="org-ul">
<li>Wed 13.15
</li>
</ul>
</li>
<li>Exercises (2)
<ul class="org-ul">
<li>Thu 9.00
</li>
</ul>
</li>
<li>Office hours:
<ul class="org-ul">
<li>JP: Mon: 13.15
</li>
<li>Nik: Thu 15.15
</li>
<li>Dan: Tue 11:00, room 5453
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <a id="Timetable" name="Timetable"></a></h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Week</th>
<th scope="col" class="right">Starts</th>
<th scope="col" class="left">Lecture 1</th>
<th scope="col" class="left">Lecture 2</th>
<th scope="col" class="left">Exercises (1)</th>
<th scope="col" class="left">Exercises (2)</th>
<th scope="col" class="left">TAs</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="right">0119</td>
<td class="left">No lecture</td>
<td class="left">Intro</td>
<td class="left">EX 1</td>
<td class="left">(No session)</td>
<td class="left">Dan</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">0127</td>
<td class="left">IP 1</td>
<td class="left">IP 2</td>
<td class="left">EX 2</td>
<td class="left">&#xa0;</td>
<td class="left">Nik</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">0202</td>
<td class="left">OO</td>
<td class="left">No lecture (∗)</td>
<td class="left">No exercises (∗)</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="right">0209</td>
<td class="left">FP 1</td>
<td class="left">FP 2</td>
<td class="left">EX 3</td>
<td class="left">&#xa0;</td>
<td class="left">Nik</td>
</tr>

<tr>
<td class="right">5</td>
<td class="right">0216</td>
<td class="left">FP 3</td>
<td class="left">CP 1</td>
<td class="left">EX 4</td>
<td class="left">&#xa0;</td>
<td class="left">Nik</td>
</tr>

<tr>
<td class="right">6</td>
<td class="right">0223</td>
<td class="left">CP 2</td>
<td class="left">LP 1</td>
<td class="left">EX 5</td>
<td class="left">&#xa0;</td>
<td class="left">?</td>
</tr>

<tr>
<td class="right">7</td>
<td class="right">0302</td>
<td class="left">LP 2</td>
<td class="left">Ljunglöf</td>
<td class="left">EX 6</td>
<td class="left">&#xa0;</td>
<td class="left">?</td>
</tr>
</tbody>
</table>

<p>
(∗): Charm Days
</p>

<p>
See table below for detail of contents.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Abbr</th>
<th scope="col" class="left">Contents</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Intro</td>
<td class="left">Models of computations; types; abstraction</td>
</tr>

<tr>
<td class="left">IP 1</td>
<td class="left">Goto ↔ Loops, Inlining procedures, Procedures → Gotos, Pointers and passing by reference</td>
</tr>

<tr>
<td class="left">IP 2</td>
<td class="left">Recursion. Substitution model in the presence of recursion, Explicit stack</td>
</tr>

<tr>
<td class="left">OO</td>
<td class="left">Inheritance, Interfaces, Notion of co/contra variance</td>
</tr>

<tr>
<td class="left">FP 1</td>
<td class="left">Algebraic Types (Pattern matching, Parametric types, Currification)</td>
</tr>

<tr>
<td class="left">FP 2</td>
<td class="left">HO Abstraction, Polymorphic functions, Translating away HOF (Inlining, Closures)</td>
</tr>

<tr>
<td class="left">FP 3</td>
<td class="left">Continuations and effects. Purity and laziness.</td>
</tr>

<tr>
<td class="left">CP 1</td>
<td class="left">Processes, channels, Resource-managing processes</td>
</tr>

<tr>
<td class="left">CP 2</td>
<td class="left">Explicit continuations</td>
</tr>

<tr>
<td class="left">LP 1</td>
<td class="left">Intro to LP; Unification</td>
</tr>

<tr>
<td class="left">LP 2</td>
<td class="left">Functions to Relations, Search as list of successes</td>
</tr>

<tr>
<td class="left">Reboot</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Ljunglöf</td>
<td class="left">Peter Ljunglöf's Guestt lecture (∗∗)</td>
</tr>

<tr>
<td class="left">EX 1</td>
<td class="left">Exercises marked with @1 in <a href="All.pdf">All.pdf</a></td>
</tr>

<tr>
<td class="left">EX 2</td>
<td class="left">Exercises marked with @2 in <a href="All.pdf">All.pdf</a></td>
</tr>

<tr>
<td class="left">EX 3</td>
<td class="left">Exercises marked with @3 in <a href="All.pdf">All.pdf</a></td>
</tr>

<tr>
<td class="left">EX 4</td>
<td class="left">Exercises marked with @4 in <a href="All.pdf">All.pdf</a></td>
</tr>

<tr>
<td class="left">EX 5</td>
<td class="left">Exercises marked with @5 in <a href="All.pdf">All.pdf</a></td>
</tr>

<tr>
<td class="left">EX 6</td>
<td class="left">?</td>
</tr>
</tbody>
</table>

<p>
(∗∗): Peter Ljunglöf will show how to write a natural language
grammar in Prolog, which will give an automatic recursive-descent
parser
</p>

<p>
Note: the contents of each exercise session is about the topics
covered in the two previous lectures. Remember to re-fetch the
<a href="All.pdf">All.pdf</a> file each week: exercises may have been updated.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Organisation</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Formal requirements</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Pass the exam (written exam)
</li>
<li>That's it!
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Informal requirements and learning aids</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Do the exercises
</li>
<li>Participate in the exercises sessions: see <a href="#sec-3-4">below</a> for details.
</li>
<li>Attend the lectures
</li>
<li>Prepare lectures by reading lecture notes and follow relevant links.
</li>
</ul>
</div>
</div>
