pp/admin.org
** Lectures
- The lecture notes can be accessed here [[http://www.cse.chalmers.se/~bernardy/pp/Lectures.html][here]]
- You can also use the source if you fancy emacs org-mode.
- I prefer to have interaction during the lectures, so feel free to
  interrupt me.
** <<Exercises>>
*** Wednesday Session
- You will be working on exercises during the session, with the help of the TAs.
  + To be able to follow what is going on, bring a printout of the
    questions.
  + It helps if you have prepared the exercises beforehand. (Remember
    to bring a written copy of your solution with you if you have
    prepared one.)
  + See the above table for which exercises you need to prepare for
    each session.
- On thursday, a TA will go through (the most important) exercises
  seen during the week.
*** Thursday Session
- You will be working on a question in the size of an exam question
- TA will grade your answer, so you will get an exam-style assessment
  before the exam
- Grades will be collected for statistics
* Reading material
+ Unfortunately, I do not know of a single textbook covering all the
  material in a suitable way. Therefore, [[file:Lectures.org][the lecture notes]] are the "master"
  source for the course.
+ The exercises [[file:All.pdf][(pdf)]] are also part of the course material.
+ Extra reading for the braves:
   + Single most relevant textbook: probably

     + "Programming Languages -- Application and Interpretation", Shriram Krishnamurthi.

     http://www.plai.org/
   #  http://www.cs.brown.edu/~sk/Publications/Books/ProgLangs/2007-04-26/

     + but
       * uses different structure
       * uses scheme (LISP) syntax
       * is written with MS and PhD students in mind

     + Relevant parts
       * Part I (To understand the point of view of the author)
       * Shreds of part II
       * Parts III, IV, VI, VII
       * Part X (Ch. 24, 25)
       * Part XI

   + Other relevant books
     - "Essentials of Programming Languages", Friedman, Wand and Haynes (http://www.eopl3.com/)
     - "Concepts, Techniques, and Models of Computer Programming", Van Roy (http://www.info.ucl.ac.be/~pvr/book.html)
     - ...

* Outline of the course
** Brief exposition of each paradigm
** (Some) Transformations between paradigms
- Explanation of programming languages features by translation.
*This is the focus of the course.*
** Learning outcomes
*** Awareness of multiple paradigms
First questions of the design phase: "How should I think about this
problem? (Do I know a paradigm suitable to express the solution?)"
*** Recognise "encoded" thoughts:
+ what is the natural paradigm
+ decode them

From this point of view, this course teaches "design patterns"

*** Encode thoughts expressed in a paradigm in another one
*** The exam questions will be similar to exercises
Note in particular that exercises are integral part of the course material.

* Course evaluation

For an overview of the process, see here:
http://www.chalmers.se/insidan/SV/utbildning-och-forskning/grundutbildning/kurs/kursutvardering

** Volunteer course representatives:

| Name                | email (student.chalmers.se) | Affiliation |
|---------------------+-----------------------------+-------------|
| Johan Becker        | johbec                      | Chalmers    |
| Samuel Berger       | bergers                     | Chalmers    |
| Jean-Philippe Green | jgreen                      | Chalmers    |
| Gregor Ulm          | gregor.ulm (gmail)          | GU          |

** Evaluation Meeting 1
All representatives were present and have signalled themselves to the class.
** Evaluation Meeting 2

Items:
*** Changes in the course since last year (History).
**** new in 2012
- Moved from Master (served as a common ground in programming for
  students with various backgrounds -- the course was given to many
  international students)
- To Bachelor (most students had basic course in FP, OO, ...); the
  focus of the course is now to explain the links between the
  paradigms, and explain new concepts by translation into known (old)
  concepts.
**** new in 2013
- Different style of exercise sessions (less interactive)
- More course material produced
**** new in 2014 (Plans)
- Students will be informed earlier which exercises are relevant.
- The solution for all questions/exercises to be found in the lecture notes
- Publish the complete code for exercise answers
**** TODO new in 2015 (plans)
- Introduce the substitution model in the first lecture; when explaining
abstraction and naming. (DONE)

- Show the final step in the closure-conv + cps style (gotos + stack)
- Move laziness to the next lecture. (DONE)
- (TODO) Clarify in the schedule which parts of the lecture notes are relevant.
- What is the purpose of each exercise session. This wasn't very clear.
- It should be made clear to everyone that the (wednesdays) exercise
  sessions are about working on exercises with the help of the TA.
**** 2016
- Labs/Mandatory exercises
*** Study climate (communication, level of workload, tutorials)
- Lecture notes are good and comprehensive
- TA very helpful
- Good constructive alignment (exam ~ course)
- Workload is adequate. Adding extra material for labs is not necessary.
