pp/admin.html
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Lectures</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>The lecture notes can be accessed here <a href="http://www.cse.chalmers.se/~bernardy/pp/Lectures.html">here</a>
</li>
<li>You can also use the source if you fancy emacs org-mode.
</li>
<li>I prefer to have interaction during the lectures, so feel free to
interrupt me.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <a id="Exercises" name="Exercises"></a></h3>
<div class="outline-text-3" id="text-3-4">
</div><ol class="org-ol"><li><a id="sec-3-4-1" name="sec-3-4-1"></a>Wednesday Session<br  /><div class="outline-text-4" id="text-3-4-1">
<ul class="org-ul">
<li>You will be working on exercises during the session, with the help of the TAs.
<ul class="org-ul">
<li>To be able to follow what is going on, bring a printout of the
questions.
</li>
<li>It helps if you have prepared the exercises beforehand. (Remember
to bring a written copy of your solution with you if you have
prepared one.)
</li>
<li>See the above table for which exercises you need to prepare for
each session.
</li>
</ul>
</li>
<li>On thursday, a TA will go through (the most important) exercises
seen during the week.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-4-2" name="sec-3-4-2"></a>Thursday Session<br  /><div class="outline-text-4" id="text-3-4-2">
<ul class="org-ul">
<li>You will be working on a question in the size of an exam question
</li>
<li>TA will grade your answer, so you will get an exam-style assessment
before the exam
</li>
<li>Grades will be collected for statistics
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Reading material</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Unfortunately, I do not know of a single textbook covering all the
material in a suitable way. Therefore, <a href="Lectures.html">the lecture notes</a> are the "master"
source for the course.
</li>
<li>The exercises <a href="All.pdf">(pdf)</a> are also part of the course material.
</li>
<li>Extra reading for the braves:
<ul class="org-ul">
<li>Single most relevant textbook: probably

<ul class="org-ul">
<li>"Programming Languages &#x2013; Application and Interpretation", Shriram Krishnamurthi.
</li>
</ul>
<p>
<a href="http://www.plai.org/">http://www.plai.org/</a>
</p>
</li>
</ul>
<ul class="org-ul">
<li>but
<ul class="org-ul">
<li>uses different structure
</li>
<li>uses scheme (LISP) syntax
</li>
<li>is written with MS and PhD students in mind
</li>
</ul>
</li>

<li>Relevant parts
<ul class="org-ul">
<li>Part I (To understand the point of view of the author)
</li>
<li>Shreds of part II
</li>
<li>Parts III, IV, VI, VII
</li>
<li>Part X (Ch. 24, 25)
</li>
<li>Part XI
</li>
</ul>
</li>

<li>Other relevant books
<ul class="org-ul">
<li>"Essentials of Programming Languages", Friedman, Wand and Haynes (<a href="http://www.eopl3.com/">http://www.eopl3.com/</a>)
</li>
<li>"Concepts, Techniques, and Models of Computer Programming", Van Roy (<a href="http://www.info.ucl.ac.be/~pvr/book.html">http://www.info.ucl.ac.be/~pvr/book.html</a>)
</li>
<li>&#x2026;
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Outline of the course</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Brief exposition of each paradigm</h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> (Some) Transformations between paradigms</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Explanation of programming languages features by translation.
</li>
</ul>
<p>
<b>This is the focus of the course.</b>
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Learning outcomes</h3>
<div class="outline-text-3" id="text-5-3">
</div><ol class="org-ol"><li><a id="sec-5-3-1" name="sec-5-3-1"></a>Awareness of multiple paradigms<br  /><div class="outline-text-4" id="text-5-3-1">
<p>
First questions of the design phase: "How should I think about this
problem? (Do I know a paradigm suitable to express the solution?)"
</p>
</div>
</li>
<li><a id="sec-5-3-2" name="sec-5-3-2"></a>Recognise "encoded" thoughts:<br  /><div class="outline-text-4" id="text-5-3-2">
<ul class="org-ul">
<li>what is the natural paradigm
</li>
<li>decode them
</li>
</ul>

<p>
From this point of view, this course teaches "design patterns"
</p>
</div>
</li>

<li><a id="sec-5-3-3" name="sec-5-3-3"></a>Encode thoughts expressed in a paradigm in another one<br  /></li>
<li><a id="sec-5-3-4" name="sec-5-3-4"></a>The exam questions will be similar to exercises<br  /><div class="outline-text-4" id="text-5-3-4">
<p>
Note in particular that exercises are integral part of the course material.
</p>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Course evaluation</h2>
<div class="outline-text-2" id="text-6">
<p>
For an overview of the process, see here:
<a href="http://www.chalmers.se/insidan/SV/utbildning-och-forskning/grundutbildning/kurs/kursutvardering">http://www.chalmers.se/insidan/SV/utbildning-och-forskning/grundutbildning/kurs/kursutvardering</a>
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Volunteer course representatives:</h3>
<div class="outline-text-3" id="text-6-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">email (student.chalmers.se)</th>
<th scope="col" class="left">Affiliation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Johan Becker</td>
<td class="left">johbec</td>
<td class="left">Chalmers</td>
</tr>

<tr>
<td class="left">Samuel Berger</td>
<td class="left">bergers</td>
<td class="left">Chalmers</td>
</tr>

<tr>
<td class="left">Jean-Philippe Green</td>
<td class="left">jgreen</td>
<td class="left">Chalmers</td>
</tr>

<tr>
<td class="left">Gregor Ulm</td>
<td class="left">gregor.ulm (gmail)</td>
<td class="left">GU</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Evaluation Meeting 1</h3>
<div class="outline-text-3" id="text-6-2">
<p>
All representatives were present and have signalled themselves to the class.
</p>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Evaluation Meeting 2</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Items:
</p>
</div>
<ol class="org-ol"><li><a id="sec-6-3-1" name="sec-6-3-1"></a>Changes in the course since last year (History).<br  /><ol class="org-ol"><li><a id="sec-6-3-1-1" name="sec-6-3-1-1"></a>new in 2012<br  /><div class="outline-text-5" id="text-6-3-1-1">
<ul class="org-ul">
<li>Moved from Master (served as a common ground in programming for
students with various backgrounds &#x2013; the course was given to many
international students)
</li>
<li>To Bachelor (most students had basic course in FP, OO, &#x2026;); the
focus of the course is now to explain the links between the
paradigms, and explain new concepts by translation into known (old)
concepts.
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-1-2" name="sec-6-3-1-2"></a>new in 2013<br  /><div class="outline-text-5" id="text-6-3-1-2">
<ul class="org-ul">
<li>Different style of exercise sessions (less interactive)
</li>
<li>More course material produced
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-1-3" name="sec-6-3-1-3"></a>new in 2014 (Plans)<br  /><div class="outline-text-5" id="text-6-3-1-3">
<ul class="org-ul">
<li>Students will be informed earlier which exercises are relevant.
</li>
<li>The solution for all questions/exercises to be found in the lecture notes
</li>
<li>Publish the complete code for exercise answers
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-1-4" name="sec-6-3-1-4"></a><span class="todo TODO">TODO</span> new in 2015 (plans)<br  /><div class="outline-text-5" id="text-6-3-1-4">
<ul class="org-ul">
<li>Introduce the substitution model in the first lecture; when explaining
</li>
</ul>
<p>
abstraction and naming. (DONE)
</p>

<ul class="org-ul">
<li>Show the final step in the closure-conv + cps style (gotos + stack)
</li>
<li>Move laziness to the next lecture. (DONE)
</li>
<li>(TODO) Clarify in the schedule which parts of the lecture notes are relevant.
</li>
<li>What is the purpose of each exercise session. This wasn't very clear.
</li>
<li>It should be made clear to everyone that the (wednesdays) exercise
sessions are about working on exercises with the help of the TA.
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-1-5" name="sec-6-3-1-5"></a>2016<br  /><div class="outline-text-5" id="text-6-3-1-5">
<ul class="org-ul">
<li>Labs/Mandatory exercises
</li>
</ul>
</div>
</li></ol>
</li>
<li><a id="sec-6-3-2" name="sec-6-3-2"></a>Study climate (communication, level of workload, tutorials)<br  /><div class="outline-text-4" id="text-6-3-2">
<ul class="org-ul">
<li>Lecture notes are good and comprehensive
</li>
<li>TA very helpful
</li>
<li>Good constructive alignment (exam ~ course)
</li>
<li>Workload is adequate. Adding extra material for labs is not necessary.
</li>
</ul>
</div>
</li>
