pp/admin.org
*** Problematic course items; can resources be used better?
- The information meeting (Programming paradigms/Concurrent
  programming) was biased, which may explain low attendance this year.
- Paradigms course helps digital construction course.
- The time slot 8.00-10.00 problematic from an attendance perspective
  * This time slot should be replaced by a mandatory lab.
- It would be good to have a self-evaluation test to check if the
  requirements are met before taking the course.
- It would be useful to add a refresher in Haskell as a 1st lecture

Exercise sheet:
- It would be nice to have an html in addition to a pdf
- Could be good to have a separate file with just the solutions

*** Course-specific questions in questionnaire; other material for final meeting?

