pp/admin.html
<li><a id="sec-6-3-3" name="sec-6-3-3"></a>Problematic course items; can resources be used better?<br  /><div class="outline-text-4" id="text-6-3-3">
<ul class="org-ul">
<li>The information meeting (Programming paradigms/Concurrent
programming) was biased, which may explain low attendance this year.
</li>
<li>Paradigms course helps digital construction course.
</li>
<li>The time slot 8.00-10.00 problematic from an attendance perspective
<ul class="org-ul">
<li>This time slot should be replaced by a mandatory lab.
</li>
</ul>
</li>
<li>It would be good to have a self-evaluation test to check if the
requirements are met before taking the course.
</li>
<li>It would be useful to add a refresher in Haskell as a 1st lecture
</li>
</ul>

<p>
Exercise sheet:
</p>
<ul class="org-ul">
<li>It would be nice to have an html in addition to a pdf
</li>
<li>Could be good to have a separate file with just the solutions
</li>
</ul>
</div>
</li>

<li><a id="sec-6-3-4" name="sec-6-3-4"></a>Course-specific questions in questionnaire; other material for final meeting?<br  /></li></ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jean-Philippe Bernardy</p>
<p class="date">Created: 2016-03-03 tor 07:42</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
